const listData = [
    {
        id: 1,
        lesson: 'Модуль 1 - Заняття 1 - Змінні та типи',
        theme: [
            {
                id: 1,
                name: 'Знайомство з JavaScript'
            },
            {
                id: 2,
                name: 'Підключення скрипта',
            },
            {
                id: 3,
                name: 'Інструменти розробника',
            },
            {
                id: 4,
                name: 'Основи синтаксису',
            },
            {
                id: 5,
                name: 'Змінні та типи',
            },
            {
                id: 6,
                name: 'Взаємодія з користувачем',
            },
            {
                id: 7,
                name: 'Основні оператори',
            },
            {
                id: 8,
                name: 'Числа',
            },
            {
                id: 9,
                name: 'Рядки',
            },
            {
                id: 10,
                name: 'Логічні оператори',
            },
        ]
    },
    {
        id: 2,
        lesson: 'Модуль 1 - Заняття 2 - Розгалуження та цикли',
        theme: [
            {
                id: 1,
                name: 'Розгалуження'
            },
            {
                id: 2,
                name: 'Тернарний оператор',
            },
            {
                id: 3,
                name: 'Інструкція Switch',
            },
            {
                id: 4,
                name: 'Область видимості',
            },
            {
                id: 5,
                name: 'Цикли',
            },
        ]
    },

];

export default listData